# Pandas 
Pandas is a Python library used for working with data sets.<br>

It has functions for analyzing, cleaning, exploring, and manipulating data.

we have 2 types of data in pandas :- <br>
<b>1) Series:, </b> <br>
<b>2? Dataframe

In [ ]:
import pandas as pd  # data preprocessing

## Series

In [2]:
import pandas as pd
s1= pd.Series([10,20,30,40,50,60,70])
print(s1)
print(type(s1))

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64
<class 'pandas.core.series.Series'>

In [14]:
print(s1.index)
print(s1.values)
print(s1.index.tolist())
print(s1.shape)
print(s1.empty)
print(s1.ndim)
print(s1.size)
print(s1.nbytes)

RangeIndex(start=0, stop=7, step=1)
[10 20 30 40 50 60 70]
[0, 1, 2, 3, 4, 5, 6]
(7,)
False
1
7
56

In [4]:
# index in series by default starts from 0 but it can be modified
s2=pd.Series([1,2,3,4,5,6,7],index=list(range(101,108)))
print(s2)

101    1
102    2
103    3
104    4
105    5
106    6
107    7
dtype: int64

In [5]:
print(s2.sum())
print(s2.mean())
print(s2.median())
print(s2.cumsum())  # cumulative sum

28
4.0
4.0
101     1
102     3
103     6
104    10
105    15
106    21
107    28
dtype: int64

#### Creating a Series using list or tuple

In [6]:
l1=[2,4,6,3,7,1,9]
t1=(10,20,30,40,26,46)

q1=pd.Series(l1)
q2=pd.Series(t1)
print(q1)
print(q2)

0    2
1    4
2    6
3    3
4    7
5    1
6    9
dtype: int64
0    10
1    20
2    30
3    40
4    26
5    46
dtype: int64

#### Create a simple Pandas Series from a dictionary:

In [7]:
import pandas as pd

calories = {"day1": 420, "day2": 380, "day3": 390}

myvar = pd.Series(calories)
print(myvar)

"""To select only some of the items in the dictionary, use the index argument and specify only the items you want to include
in the Series."""
myvar2 = pd.Series(calories, index = ["day1", "day2"])
print(myvar2)

day1    420
day2    380
day3    390
dtype: int64
day1    420
day2    380
dtype: int64

   <b> head(n): </b> Returns the first n elements of the Series.<br>
     <b>tail(n):</b> Returns the last n elements of the Series.<br>
     <b>describe():</b> Generates descriptive statistics of the Series, such as count, mean, standard deviation, etc.<br>
     <b>mean():</b> Computes the mean of the values in the Series.<br>
    <b> sum():</b> Computes the sum of the values in the Series.<br>
     <b>min(), max():</b> Returns the minimum and maximum values in the Series.<br>
     <b>sort_values():</b> Sorts the Series in ascending or descending order.
     <b>unique(): </b>Returns an array of unique values in the Series.<br>
     <b>value_counts():</b> Computes the frequency of each unique value in the Series.<br>
     <b>apply(func):</b> Applies a function to each element of the Series.<br>
     <b>map(dict):</b> Replaces values in the Series with corresponding keys from a dictionary.<br>

### Accessing the elements in Series:-
it can be done through indexing and Slicing

In [8]:
import pandas as pd

# Create a Series
data = [10, 20, 30, 40, 50]
index = ['A', 'B', 'C', 'D', 'E']
series = pd.Series(data, index=index)

# Access an element by index label
print(series['B']) 

# Access multiple elements by index labels
print(series[['A', 'C', 'E']])

# Access an element by position using integer index
print(series[2]) 

# Access a range of elements using slicing
print(series[1:4])

20
A    10
C    30
E    50
dtype: int64
30
B    20
C    30
D    40
dtype: int64

### Modifying elements in Series
To modify elements in a Pandas Series, you can use indexing or boolean conditions to select specific elements and assign new values to them.

In [9]:
data = [10, 20, 30, 40, 50]
index = ['A', 'B', 'C', 'D', 'E']
series = pd.Series(data, index=index)

# Modify an element by index label
series['B'] = 25
print(series)

# Modify multiple elements using boolean condition
series[series > 30] = 0
print(series)

A    10
B    25
C    30
D    40
E    50
dtype: int64
A    10
B    25
C    30
D     0
E     0
dtype: int64

### loc()
The loc function in Pandas is used to access elements in a Series or DataFrame using label-based indexing. It allows you to select rows and columns based on their labels rather than their positions. <br>
series.loc[label]

In [10]:
import pandas as pd
series = pd.Series([10, 20, 30, 40, 50], index=['A', 'B', 'C', 'D', 'E'])

# Access a single element using its label
value = series.loc['B']
print(value)

# Access multiple elements using a list of labels
values = series.loc[['A', 'C', 'E']]
print(values)

# Access elements based on a condition
values = series.loc[series > 30]
print(values)

# Access a slice of elements using labels
values = series.loc['B':'D']
print(values)

20
A    10
C    30
E    50
dtype: int64
D    40
E    50
dtype: int64
B    20
C    30
D    40
dtype: int64

### Binary operation methods on 2 or more Series:
<b>add()	</b>Method is used to add series or list like objects with same length to the caller series<br>
<b>sub()	</b>Method is used to subtract series or list like objects with same length from the caller series<br>
<b>mul()	</b>Method is used to multiply series or list like objects with same length with the caller series<br>
<b>div()	</b>Method is used to divide series or list like objects with same length by the caller series<br>
<b>sum()	</b>Returns the sum of the values for the requested axis<br>
<b>prod()	</b>Returns the product of the values for the requested axis<br>
<b>mean()	</b>Returns the mean of the values for the requested axis<br>
<b>pow()	</b>Method is used to put each element of passed series as exponential power of caller series and returned the results<br>
<b>abs()	</b>Method is used to get the absolute numeric value of each element in Series/DataFrame<br>
<b>cov()	</b>Method is used to find covariance of two series<br>

In [ ]:
# creating a series
data = pd.Series([5, 2, 3,7], index=['a', 'b', 'c', 'd'])
 
# creating a series
data1 = pd.Series([1, 6, 4, 9], index=['a', 'b', 'd', 'e'])
 
print(data, "\n\n", data1)

# adding two series using
# .add
data.add(data1, fill_value=0)

# subtracting two series using
# .sub
data.sub(data1, fill_value=0)



## DataFrame

### Methods to create a DataFrame

#### 1) Using dictionary 
Each key represents a column name and the corresponding value is a list or array containing the column's data.

In [69]:
import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'London', 'Paris']}
df0 = pd.DataFrame(data)
print(df0)

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris

#### 2) using list of list
each inner list represents a row of data in the DataFrame.

In [16]:
import pandas as pd

data = [['Alice', 25, 'New York'],
        ['Bob', 30, 'London'],
        ['Charlie', 35, 'Paris']]
df = pd.DataFrame(data, columns=['Name', 'Age', 'City'])
print(df)

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris

#### 3) Using Series

In [73]:
n1=pd.Series([1,2,3,4,])
n2=pd.Series([90,80,70,60])
d=pd.DataFrame({'n1':n1,'n2':n2})
print(d)

   n1  n2
0   1  90
1   2  80
2   3  70
3   4  60

In [58]:
print(df.index)
print(df.values)
print(df.columns)
print(type(df.columns))
print(df.columns.tolist())
print(df.shape)
print(df.empty)
print(df.ndim)
print(df.size)

RangeIndex(start=0, stop=3, step=1)
[['Alice' 25 'New York']
 ['Bob' 30 'London']
 ['Charlie' 35 'Paris']]
Index(['Name', 'Age', 'City'], dtype='object')
<class 'pandas.core.indexes.base.Index'>
['Name', 'Age', 'City']
(3, 3)
False
2
9

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [60]:
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

#### Accessing Rows and Columns

In [24]:
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'London', 'Paris']}
df1 = pd.DataFrame(data)

# Access a column by name (use single square brackets)
column = df1['Name']
print(column)

# Access multiple columns by names (use double square brakets)
subset = df1[['Name', 'City']]
print(subset)

# Access a row by index
row = df1.loc[1]
print(row)

# Access a specific value by row index and column name
value = df1.loc[2, 'Age']
print(value)

# Access a subset of the DataFrame using boolean conditions
subset = df1[df['Age'] > 30]
print(subset)

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object
      Name      City
0    Alice  New York
1      Bob    London
2  Charlie     Paris
Name       Bob
Age         30
City    London
Name: 1, dtype: object
35
      Name  Age   City
2  Charlie   35  Paris

In [49]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily', 'Frank', 'Grace', 'Henry'],
    'Age': [25, 30, 35, 28, 32, 45, 20, 38],
    'City': ['New York', 'London', 'Paris', 'Tokyo', 'Sydney', 'Berlin', 'Toronto', 'Rome']}
df3 = pd.DataFrame(data)
df3

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris
3    David   28     Tokyo
4    Emily   32    Sydney
5    Frank   45    Berlin
6    Grace   20   Toronto
7    Henry   38      Rome

#### head() Function:
The head() function is used to display the first n rows of a DataFrame. By default, it returns the first 5 rows if no value is specified for n.

In [31]:
df.head()

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris

In [32]:
df.head(3)

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris

#### tail() Function:
The tail() function is used to display the last n rows of a DataFrame. By default, it returns the last 5 rows if no value is specified for n.

In [50]:
df3.tail()

    Name  Age     City
3  David   28    Tokyo
4  Emily   32   Sydney
5  Frank   45   Berlin
6  Grace   20  Toronto
7  Henry   38     Rome

In [51]:
df3.tail(3)

    Name  Age     City
5  Frank   45   Berlin
6  Grace   20  Toronto
7  Henry   38     Rome

#### sample() function :
1 random row by default, otherwise n random rows where n is passes as an argument

In [44]:
df3.sample()

       Name  Age       City
8  Isabella   27  Melbourne

In [45]:
df3.sample(2)

      Name  Age    City
5    Frank   45  Berlin
2  Charlie   35   Paris

#### add a new column to a data frame

In [53]:
df3['Course']=['Btech','MCA','BCA','BCom','MBA','MA','BSE','BA']
df3

      Name  Age      City Course
0    Alice   25  New York  Btech
1      Bob   30    London    MCA
2  Charlie   35     Paris    BCA
3    David   28     Tokyo   BCom
4    Emily   32    Sydney    MBA
5    Frank   45    Berlin     MA
6    Grace   20   Toronto    BSE
7    Henry   38      Rome     BA

In [68]:
# fetch single column data from df
print(df3['City'])
print(df3[['City']])

0    New York
1      London
2       Paris
3       Tokyo
4      Sydney
5      Berlin
6     Toronto
7        Rome
Name: City, dtype: object
       City
0  New York
1    London
2     Paris
3     Tokyo
4    Sydney
5    Berlin
6   Toronto
7      Rome

In [64]:
print(type(df['City']))
print(type(df[['City']]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

#### sort()
by default ascending,<br>
for descending, use ascending=False

In [74]:
df3.sort_values(by='Age')

      Name  Age      City Course
6    Grace   20   Toronto    BSE
0    Alice   25  New York  Btech
3    David   28     Tokyo   BCom
1      Bob   30    London    MCA
4    Emily   32    Sydney    MBA
2  Charlie   35     Paris    BCA
7    Henry   38      Rome     BA
5    Frank   45    Berlin     MA

In [75]:
df3.sort_values(by='Age',ascending=False)

      Name  Age      City Course
5    Frank   45    Berlin     MA
7    Henry   38      Rome     BA
2  Charlie   35     Paris    BCA
4    Emily   32    Sydney    MBA
1      Bob   30    London    MCA
3    David   28     Tokyo   BCom
0    Alice   25  New York  Btech
6    Grace   20   Toronto    BSE

In [76]:
df3.sort_values(by='Name',ascending=False)

      Name  Age      City Course
7    Henry   38      Rome     BA
6    Grace   20   Toronto    BSE
5    Frank   45    Berlin     MA
4    Emily   32    Sydney    MBA
3    David   28     Tokyo   BCom
2  Charlie   35     Paris    BCA
1      Bob   30    London    MCA
0    Alice   25  New York  Btech

#### Sort index
columns are considered as index at axis 1 <br>
index are considered as index at axis 1

In [80]:
df3.sort_index(axis=1,ascending=False)

      Name Course      City  Age
0    Alice  Btech  New York   25
1      Bob    MCA    London   30
2  Charlie    BCA     Paris   35
3    David   BCom     Tokyo   28
4    Emily    MBA    Sydney   32
5    Frank     MA    Berlin   45
6    Grace    BSE   Toronto   20
7    Henry     BA      Rome   38

In [82]:
df3.sort_index(axis=0,ascending=False)

      Name  Age      City Course
7    Henry   38      Rome     BA
6    Grace   20   Toronto    BSE
5    Frank   45    Berlin     MA
4    Emily   32    Sydney    MBA
3    David   28     Tokyo   BCom
2  Charlie   35     Paris    BCA
1      Bob   30    London    MCA
0    Alice   25  New York  Btech

#### set a columns as the index of dataframe

In [84]:
df5=df3.set_index('Course')
df5

           Name  Age      City
Course
Btech     Alice   25  New York
MCA         Bob   30    London
BCA     Charlie   35     Paris
BCom      David   28     Tokyo
MBA       Emily   32    Sydney
MA        Frank   45    Berlin
BSE       Grace   20   Toronto
BA        Henry   38      Rome

#### Filtering

##### Q) Filter all records from dataframe where Age is even
there are 2 ways

In [88]:
df3[df3['Age']%2==0]

    Name  Age     City Course
1    Bob   30   London    MCA
3  David   28    Tokyo   BCom
4  Emily   32   Sydney    MBA
6  Grace   20  Toronto    BSE
7  Henry   38     Rome     BA

In [91]:
df3.query('Age%2!=0')

      Name  Age      City Course
0    Alice   25  New York  Btech
2  Charlie   35     Paris    BCA
5    Frank   45    Berlin     MA

In [93]:
df3.query('Name=="Frank" or Course=="BSE"')

    Name  Age     City Course
5  Frank   45   Berlin     MA
6  Grace   20  Toronto    BSE

In [94]:
df3.query('Name=="Frank" and Course=="BSE"')

Empty DataFrame
Columns: [Name, Age, City, Course]
Index: []

#### Renaming all the columns

In [98]:
df3.columns=['First Name','Age','Location','Enrolled from']
df3.columns

Index(['First Name', 'Age', 'Location', 'Enrolled from'], dtype='object')

## Read CSV Files

CSV files (comma separated files).<br>

CSV files contains plain text and is a well know format that can be read by everyone including Pandas.

#### Load the CSV into a DataFrame:
If you have a large DataFrame with many rows, Pandas will only return the first 5 rows, and the last 5 rows.<br>
to_string() to print the entire DataFrame.

In [101]:
import pandas as pd

df = pd.read_csv('C:\\pyhthon + ML\\data.csv')

print(df.to_string())

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
5          60    102       127     300.0
6          60    110       136     374.0
7          45    104       134     253.3
8          30    109       133     195.1
9          60     98       124     269.0
10         60    103       147     329.3
11         60    100       120     250.7
12         60    106       128     345.3
13         60    104       132     379.3
14         60     98       123     275.0
15         60     98       120     215.2
16         60    100       120     300.0
17         45     90       112       NaN
18         60    103       123     323.0
19         45     97       125     243.0
20         60    108       131     364.2
21         45    100       119     282.0
22         60    130       101     300.0
23         45    105       132     246.0
24         60    102       126     334.5
25         60    100       120     250.0
26         60     92       118     241.0
27         60    103       132       NaN
28         60    100       132     280.0
29         60    102       129     380.3
30         60     92       115     243.0
31         45     90       112     180.1
32         60    101       124     299.0
33         60     93       113     223.0
34         60    107       136     361.0
35         60    114       140     415.0
36         60    102       127     300.0
37         60    100       120     300.0
38         60    100       120     300.0
39         45    104       129     266.0
40         45     90       112     180.1
41         60     98       126     286.0
42         60    100       122     329.4
43         60    111       138     400.0
44         60    111       131     397.0
45         60     99       119     273.0
46         60    109       153     387.6
47         45    111       136     300.0
48         45    108       129     298.0
49         60    111       139     397.6
50         60    107       136     380.2
51         80    123       146     643.1
52         60    106       130     263.0
53         60    118       151     486.0
54         30    136       175     238.0
55         60    121       146     450.7
56         60    118       121     413.0
57         45    115       144     305.0
58         20    153       172     226.4
59         45    123       152     321.0
60        210    108       160    1376.0
61        160    110       137    1034.4
62        160    109       135     853.0
63         45    118       141     341.0
64         20    110       130     131.4
65        180     90       130     800.4
66        150    105       135     873.4
67        150    107       130     816.0
68         20    106       136     110.4
69        300    108       143    1500.2
70        150     97       129    1115.0
71         60    109       153     387.6
72         90    100       127     700.0
73        150     97       127     953.2
74         45    114       146     304.0
75         90     98       125     563.2
76         45    105       134     251.0
77         45    110       141     300.0
78        120    100       130     500.4
79        270    100       131    1729.0
80         30    159       182     319.2
81         45    149       169     344.0
82         30    103       139     151.1
83        120    100       130     500.0
84         45    100       120     225.3
85         30    151       170     300.0
86         45    102       136     234.0
87        120    100       157    1000.1
88         45    129       103     242.0
89         20     83       107      50.3
90        180    101       127     600.1
91         45    107       137       NaN
92         30     90       107     105.3
93         15     80       100      50.5
94         20    150       171     127.4
95         20    151       168     229.4
96         30     95       128     128.2
97         25    152       168     244.2
98         30    109       131     188.2
99         90     93       124     604.1
100        20     95       112      77.7
101        90     90       110     500.0
102        90     90       100     500.0
103        90     90       100     500.4
104        30     92       108      92.7
105        30     93       128     124.0
106       180     90       120     800.3
107        30     90       120      86.2
108        90     90       120     500.3
109       210    137       184    1860.4
110        60    102       124     325.2
111        45    107       124     275.0
112        15    124       139     124.2
113        45    100       120     225.3
114        60    108       131     367.6
115        60    108       151     351.7
116        60    116       141     443.0
117        60     97       122     277.4
118        60    105       125       NaN
119        60    103       124     332.7
120        30    112       137     193.9
121        45    100       120     100.7
122        60    119       169     336.7
123        60    107       127     344.9
124        60    111       151     368.5
125        60     98       122     271.0
126        60     97       124     275.3
127        60    109       127     382.0
128        90     99       125     466.4
129        60    114       151     384.0
130        60    104       134     342.5
131        60    107       138     357.5
132        60    103       133     335.0
133        60    106       132     327.5
134        60    103       136     339.0
135        20    136       156     189.0
136        45    117       143     317.7
137        45    115       137     318.0
138        45    113       138     308.0
139        20    141       162     222.4
140        60    108       135     390.0
141        60     97       127       NaN
142        45    100       120     250.4
143        45    122       149     335.4
144        60    136       170     470.2
145        45    106       126     270.8
146        60    107       136     400.0
147        60    112       146     361.9
148        30    103       127     185.0
149        60    110       150     409.4
150        60    106       134     343.0
151        60    109       129     353.2
152        60    109       138     374.0
153        30    150       167     275.8
154        60    105       128     328.0
155        60    111       151     368.5
156        60     97       131     270.4
157        60    100       120     270.4
158        60    114       150     382.8
159        30     80       120     240.9
160        30     85       120     250.4
161        45     90       130     260.4
162        45     95       130     270.0
163        45    100       140     280.9
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4